From d072ddf0a6c4827d1f85d3241ccc237e1e9bf02d Mon Sep 17 00:00:00 2001
From: Daniel Zhang <danielzhang130@gmail.com>
Date: Fri, 3 Nov 2023 20:48:06 -0400
Subject: [PATCH] Update dump

Change-Id: I91b88148077faa7b68e0c300ce638cb653e8e77a
Signed-off-by: Daniel Zhang <danielzhang130@gmail.com>
---
 34/64/arm64/source-based/libcrypto.so.lsdump  | 1561 +++++++++++++----
 .../source-based/libcrypto.so.lsdump          | 1523 ++++++++++++----
 2 files changed, 2361 insertions(+), 723 deletions(-)

diff --git a/34/64/arm64/source-based/libcrypto.so.lsdump b/34/64/arm64/source-based/libcrypto.so.lsdump
index 524bf5c5..58d4a3bd 100644
--- a/34/64/arm64/source-based/libcrypto.so.lsdump
+++ b/34/64/arm64/source-based/libcrypto.so.lsdump
@@ -8872,331 +8872,364 @@
      "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
     },
     {
-     "referenced_type" : "_ZTIPK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
     },
     {
      "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",

+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "size" : 8,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "size" : 8,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "size" : 8,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
+   "size" : 8,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
+   "size" : 8,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIPFiiiP11bn_gencb_stE",
+   "name" : "int (*)(int, int, bn_gencb_st *)",
+   "referenced_type" : "_ZTIFiiiP11bn_gencb_stE",
+   "self_type" : "_ZTIPFiiiP11bn_gencb_stE",
+   "size" : 8,
+   "source_file" : "external/boringssl/src/include/openssl/bn.h"
   },
   {
    "alignment" : 8,
@@ -38336,17 +38732,8 @@
    "alignment" : 8,
    "linker_set_key" : "_ZTIPK12ASN1_ITEM_st",
    "name" : "const ASN1_ITEM_st *",
-   "referenced_type" : "_ZTIK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
-   "self_type" : "_ZTIPK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
-   "size" : 8,
-   "source_file" : "external/boringssl/src/include/openssl/x509.h"
-  },
-  {
-   "alignment" : 8,
-   "linker_set_key" : "_ZTIPK12ASN1_ITEM_st",
-   "name" : "const ASN1_ITEM_st *",
-   "referenced_type" : "_ZTIK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509v3/v3_pcons.sdump",
-   "self_type" : "_ZTIPK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509v3/v3_pcons.sdump",
+   "referenced_type" : "_ZTIK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
+   "self_type" : "_ZTIPK12ASN1_ITEM_st",
    "size" : 8,
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
@@ -40751,196 +41138,628 @@
    "size" : 8,
    "source_file" : "external/boringssl/src/include/openssl/siphash.h"
   },
-  {
-   "is_const" : true,
-   "linker_set_key" : "_ZTIKv",
-   "name" : "const void",
-   "referenced_type" : "_ZTIv",
-   "self_type" : "_ZTIKv",
-   "source_file" : "external/boringssl/src/include/openssl/stack.h"
-  }
- ],
- "record_types" :
- [
+  {
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKv",
+   "name" : "const void",
+   "referenced_type" : "_ZTIv",
+   "self_type" : "_ZTIKv",
+   "source_file" : "external/boringssl/src/include/openssl/stack.h"
+  }
+ ],
+ "record_types" :
+ [
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "r",
+     "referenced_type" : "_ZTIP9bignum_st"
+    },
+    {
+     "field_name" : "s",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIP9bignum_st"
+    }
+   ],
+   "linker_set_key" : "_ZTI10DSA_SIG_st",
+   "name" : "DSA_SIG_st",
+   "referenced_type" : "_ZTI10DSA_SIG_st",
+   "self_type" : "_ZTI10DSA_SIG_st",
+   "size" : 16,
+   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "rd_key",
+     "referenced_type" : "_ZTIA60_j"
+    },
+    {
+     "field_name" : "rounds",
+     "field_offset" : 1920,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI10aes_key_st",
+   "name" : "aes_key_st",
+   "referenced_type" : "_ZTI10aes_key_st",
+   "self_type" : "_ZTI10aes_key_st",
+   "size" : 244,
+   "source_file" : "external/boringssl/src/include/openssl/aes.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "length",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "data",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPc"
+    },
+    {
+     "field_name" : "max",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI10buf_mem_st",
+   "name" : "buf_mem_st",
+   "referenced_type" : "_ZTI10buf_mem_st",
+   "self_type" : "_ZTI10buf_mem_st",
+   "size" : 24,
+   "source_file" : "external/boringssl/src/include/openssl/buf.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "x",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "y",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "data",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIA256_j"
+    }
+   ],
+   "linker_set_key" : "_ZTI10rc4_key_st",
+   "name" : "rc4_key_st",
+   "referenced_type" : "_ZTI10rc4_key_st",
+   "self_type" : "_ZTI10rc4_key_st",
+   "size" : 1032,
+   "source_file" : "external/boringssl/src/include/openssl/rc4.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "issuer_cert",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPK7x509_st"
+    },
+    {
+     "field_name" : "subject_cert",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK7x509_st"
+    },
+    {
+     "field_name" : "subject_req",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK11X509_req_st"
+    },
+    {
+     "field_name" : "crl",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPK11X509_crl_st"
+    },
+    {
+     "field_name" : "db",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPK7conf_st"
+    }
+   ],
+   "linker_set_key" : "_ZTI10v3_ext_ctx",
+   "name" : "v3_ext_ctx",
+   "referenced_type" : "_ZTI10v3_ext_ctx",
+   "self_type" : "_ZTI10v3_ext_ctx",
+   "size" : 48,
+   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "offset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "unused",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP20asn1_must_be_null_st"
+    },
+    {
+     "field_name" : "tbl",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK17ASN1_ADB_TABLE_st"
+    },
+    {
+     "field_name" : "tblcount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIl"
+    },
+    {
+     "field_name" : "default_tt",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPK16ASN1_TEMPLATE_st"
+    },
+    {
+     "field_name" : "null_tt",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIPK16ASN1_TEMPLATE_st"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_ADB_st",
+   "name" : "ASN1_ADB_st",
+   "referenced_type" : "_ZTI11ASN1_ADB_st",
+   "self_type" : "_ZTI11ASN1_ADB_st",
+   "size" : 56,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st",
+   "self_type" : "_ZTI11ASN1_AUX_st",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
   {
    "alignment" : 8,
    "fields" :
    [
     {
-     "field_name" : "r",
-     "referenced_type" : "_ZTIP9bignum_st"
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "s",
+     "field_name" : "flags",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIP9bignum_st"
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10DSA_SIG_st",
-   "name" : "DSA_SIG_st",
-   "referenced_type" : "_ZTI10DSA_SIG_st",
-   "self_type" : "_ZTI10DSA_SIG_st",
-   "size" : 16,
-   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
-   "alignment" : 4,
+   "alignment" : 8,
    "fields" :
    [
     {
-     "field_name" : "rd_key",
-     "referenced_type" : "_ZTIA60_j"
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "rounds",
-     "field_offset" : 1920,
+     "field_name" : "flags",
+     "field_offset" : 64,
      "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10aes_key_st",
-   "name" : "aes_key_st",
-   "referenced_type" : "_ZTI10aes_key_st",
-   "self_type" : "_ZTI10aes_key_st",
-   "size" : 244,
-   "source_file" : "external/boringssl/src/include/openssl/aes.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 8,
    "fields" :
    [
     {
-     "field_name" : "length",
-     "referenced_type" : "_ZTIm"
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "data",
+     "field_name" : "flags",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPc"
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "max",
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIm"
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10buf_mem_st",
-   "name" : "buf_mem_st",
-   "referenced_type" : "_ZTI10buf_mem_st",
-   "self_type" : "_ZTI10buf_mem_st",
-   "size" : 24,
-   "source_file" : "external/boringssl/src/include/openssl/buf.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
-   "alignment" : 4,
+   "alignment" : 8,
    "fields" :
    [
     {
-     "field_name" : "x",
-     "referenced_type" : "_ZTIj"
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "y",
-     "field_offset" : 32,
+     "field_name" : "flags",
+     "field_offset" : 64,
      "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "data",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIA256_j"
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10rc4_key_st",
-   "name" : "rc4_key_st",
-   "referenced_type" : "_ZTI10rc4_key_st",
-   "self_type" : "_ZTI10rc4_key_st",
-   "size" : 1032,
-   "source_file" : "external/boringssl/src/include/openssl/rc4.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 8,
    "fields" :
    [
     {
-     "field_name" : "flags",
-     "referenced_type" : "_ZTIi"
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "issuer_cert",
+     "field_name" : "flags",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPK7x509_st"
-    },
-    {
-     "field_name" : "subject_cert",
-     "field_offset" : 128,
-     "referenced_type" : "_ZTIPK7x509_st"
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "subject_req",
-     "field_offset" : 192,
-     "referenced_type" : "_ZTIPK11X509_req_st"
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
     },
     {
-     "field_name" : "crl",
-     "field_offset" : 256,
-     "referenced_type" : "_ZTIPK11X509_crl_st"
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump"
     },
     {
-     "field_name" : "db",
-     "field_offset" : 320,
-     "referenced_type" : "_ZTIPK7conf_st"
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10v3_ext_ctx",
-   "name" : "v3_ext_ctx",
-   "referenced_type" : "_ZTI10v3_ext_ctx",
-   "self_type" : "_ZTI10v3_ext_ctx",
-   "size" : 48,
-   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 8,
    "fields" :
    [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
     {
      "field_name" : "flags",
+     "field_offset" : 64,
      "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "offset",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIm"
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
     },
     {
-     "field_name" : "unused",
+     "field_name" : "asn1_cb",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIP20asn1_must_be_null_st"
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump"
     },
     {
-     "field_name" : "tbl",
+     "field_name" : "enc_offset",
      "field_offset" : 192,
-     "referenced_type" : "_ZTIPK17ASN1_ADB_TABLE_st"
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "size" : 32,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "tblcount",
-     "field_offset" : 256,
-     "referenced_type" : "_ZTIl"
+     "field_name" : "flags",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "default_tt",
-     "field_offset" : 320,
-     "referenced_type" : "_ZTIPK16ASN1_TEMPLATE_st"
+     "field_name" : "ref_offset",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIi"
     },
     {
-     "field_name" : "null_tt",
-     "field_offset" : 384,
-     "referenced_type" : "_ZTIPK16ASN1_TEMPLATE_st"
+     "field_name" : "asn1_cb",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI11ASN1_ADB_st",
-   "name" : "ASN1_ADB_st",
-   "referenced_type" : "_ZTI11ASN1_ADB_st",
-   "self_type" : "_ZTI11ASN1_ADB_st",
-   "size" : 56,
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "size" : 32,
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
@@ -40964,7 +41783,7 @@
     {
      "field_name" : "asn1_cb",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE"
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump"
     },
     {
      "field_name" : "enc_offset",
@@ -40974,8 +41793,8 @@
    ],
    "linker_set_key" : "_ZTI11ASN1_AUX_st",
    "name" : "ASN1_AUX_st",
-   "referenced_type" : "_ZTI11ASN1_AUX_st",
-   "self_type" : "_ZTI11ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
    "size" : 32,
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
@@ -41000,7 +41819,7 @@
     {
      "field_name" : "asn1_cb",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump"
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump"
     },
     {
      "field_name" : "enc_offset",
@@ -41010,8 +41829,8 @@
    ],
    "linker_set_key" : "_ZTI11ASN1_AUX_st",
    "name" : "ASN1_AUX_st",
-   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
-   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm64_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
    "size" : 32,
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
diff --git a/34/64/arm_arm64/source-based/libcrypto.so.lsdump b/34/64/arm_arm64/source-based/libcrypto.so.lsdump
index 3bd3cdc8..3bfd6363 100644
--- a/34/64/arm_arm64/source-based/libcrypto.so.lsdump
+++ b/34/64/arm_arm64/source-based/libcrypto.so.lsdump
@@ -8888,509 +8888,797 @@
      "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
     },
     {
-     "referenced_type" : "_ZTIPK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
     },
     {
      "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
    "return_type" : "_ZTIi",
-   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFiiiP11bn_gencb_stE",
-   "name" : "int (int, int, bn_gencb_st *)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
      "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
     },
     {
-     "referenced_type" : "_ZTIP11bn_gencb_st"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFiiiP11bn_gencb_stE",
-   "return_type" : "_ZTIi",
-   "self_type" : "_ZTIFiiiP11bn_gencb_stE",
-   "source_file" : "external/boringssl/src/include/openssl/bn.h"
-  },
-  {
-   "alignment" : 4,
-   "linker_set_key" : "_ZTIFivE",
-   "name" : "int (void)",
-   "referenced_type" : "_ZTIFivE",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
    "return_type" : "_ZTIi",
-   "self_type" : "_ZTIFivE",
-   "source_file" : "external/boringssl/src/include/openssl/rand.h"
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFjPK6rsa_stE",
-   "name" : "unsigned int (const rsa_st *)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPK6rsa_st"
-    }
-   ],
-   "referenced_type" : "_ZTIFjPK6rsa_stE",
-   "return_type" : "_ZTIj",
-   "self_type" : "_ZTIFjPK6rsa_stE",
-   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
-  },
-  {
-   "alignment" : 4,
-   "linker_set_key" : "_ZTIFjPK9ec_key_stE",
-   "name" : "unsigned int (const ec_key_st *)",
-   "parameters" :
-   [
+     "referenced_type" : "_ZTIi"
+    },
     {
-     "referenced_type" : "_ZTIPK9ec_key_st"
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
+    },
+    {
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFjPK9ec_key_stE",
-   "return_type" : "_ZTIj",
-   "self_type" : "_ZTIFjPK9ec_key_stE",
-   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
-   "name" : "long (bio_st *, int, long (*)(bio_st *, int, const char *, int, long, long))",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIP6bio_st"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
     },
     {
-     "referenced_type" : "_ZTIPFlP6bio_stiPKcillE"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
-   "return_type" : "_ZTIl",
-   "self_type" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
-   "source_file" : "external/boringssl/src/include/openssl/bio.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFlP6bio_stiPKcillE",
-   "name" : "long (bio_st *, int, const char *, int, long, long)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
-    {
-     "referenced_type" : "_ZTIP6bio_st"
-    },
     {
      "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIPKc"
-    },
-    {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
     },
     {
-     "referenced_type" : "_ZTIl"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
     },
     {
-     "referenced_type" : "_ZTIl"
+     "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFlP6bio_stiPKcillE",
-   "return_type" : "_ZTIl",
-   "self_type" : "_ZTIFlP6bio_stiPKcillE",
-   "source_file" : "external/boringssl/src/include/openssl/bio.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFlP6bio_stilPvE",
-   "name" : "long (bio_st *, int, long, void *)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIP6bio_st"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
     },
     {
-     "referenced_type" : "_ZTIl"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
     },
     {
      "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFlP6bio_stilPvE",
-   "return_type" : "_ZTIl",
-   "self_type" : "_ZTIFlP6bio_stilPvE",
-   "source_file" : "external/boringssl/src/include/openssl/bio.h"
-  },
-  {
-   "alignment" : 4,
-   "linker_set_key" : "_ZTIFmvE",
-   "name" : "unsigned long (void)",
-   "referenced_type" : "_ZTIFmvE",
-   "return_type" : "_ZTIm",
-   "self_type" : "_ZTIFmvE",
-   "source_file" : "external/boringssl/src/include/openssl/thread.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFvP20CRYPTO_dynlock_valuePKciE",
-   "name" : "void (CRYPTO_dynlock_value *, const char *, int)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIPKc"
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
     },
     {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFvP20CRYPTO_dynlock_valuePKciE",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFvP20CRYPTO_dynlock_valuePKciE",
-   "source_file" : "external/boringssl/src/include/openssl/thread.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFvPFvPvES_E",
-   "name" : "void (void (*)(void *), void *)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPFvPvE"
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
+    },
+    {
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
     },
     {
      "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFvPFvPvES_E",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFvPFvPvES_E",
-   "source_file" : "external/boringssl/src/include/openssl/stack.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFvPKviE",
-   "name" : "void (const void *, int)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPKv"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
+    },
+    {
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFvPKviE",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFvPKviE",
-   "source_file" : "external/boringssl/src/include/openssl/rand.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFvPKvidE",
-   "name" : "void (const void *, int, double)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPKv"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
     },
     {
-     "referenced_type" : "_ZTId"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFvPKvidE",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFvPKvidE",
-   "source_file" : "external/boringssl/src/include/openssl/rand.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFvPiE",
-   "name" : "void (int *)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPi"
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
+    },
+    {
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFvPiE",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFvPiE",
-   "source_file" : "external/boringssl/src/include/openssl/thread.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFvPvE",
-   "name" : "void (void *)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
+    {
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
+    },
+    {
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
+    },
     {
      "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFvPvE",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFvPvE",
-   "source_file" : "external/boringssl/src/include/openssl/stack.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFvPvS_P17crypto_ex_data_stilS_E",
-   "name" : "void (void *, void *, crypto_ex_data_st *, int, long, void *)",
+   "linker_set_key" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPv"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIPv"
+     "referenced_type" : "_ZTIPP13ASN1_VALUE_st"
     },
     {
-     "referenced_type" : "_ZTIP17crypto_ex_data_st"
-    },
-    {
-     "referenced_type" : "_ZTIi"
-    },
-    {
-     "referenced_type" : "_ZTIl"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
     },
     {
      "referenced_type" : "_ZTIPv"
     }
    ],
-   "referenced_type" : "_ZTIFvPvS_P17crypto_ex_data_stilS_E",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFvPvS_P17crypto_ex_data_stilS_E",
-   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFviP20CRYPTO_dynlock_valuePKciE",
-   "name" : "void (int, CRYPTO_dynlock_value *, const char *, int)",
+   "linker_set_key" : "_ZTIFiiiP11bn_gencb_stE",
+   "name" : "int (int, int, bn_gencb_st *)",
    "parameters" :
    [
     {
      "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
-    },
-    {
-     "referenced_type" : "_ZTIPKc"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIP11bn_gencb_st"
     }
    ],
-   "referenced_type" : "_ZTIFviP20CRYPTO_dynlock_valuePKciE",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFviP20CRYPTO_dynlock_valuePKciE",
-   "source_file" : "external/boringssl/src/include/openssl/thread.h"
+   "referenced_type" : "_ZTIFiiiP11bn_gencb_stE",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFiiiP11bn_gencb_stE",
+   "source_file" : "external/boringssl/src/include/openssl/bn.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFviiPKciE",
-   "name" : "void (int, int, const char *, int)",
+   "linker_set_key" : "_ZTIFivE",
+   "name" : "int (void)",
+   "referenced_type" : "_ZTIFivE",
+   "return_type" : "_ZTIi",
+   "self_type" : "_ZTIFivE",
+   "source_file" : "external/boringssl/src/include/openssl/rand.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFjPK6rsa_stE",
+   "name" : "unsigned int (const rsa_st *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIi"
-    },
-    {
-     "referenced_type" : "_ZTIi"
-    },
-    {
-     "referenced_type" : "_ZTIPKc"
-    },
-    {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIPK6rsa_st"
     }
    ],
-   "referenced_type" : "_ZTIFviiPKciE",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFviiPKciE",
-   "source_file" : "external/boringssl/src/include/openssl/thread.h"
+   "referenced_type" : "_ZTIFjPK6rsa_stE",
+   "return_type" : "_ZTIj",
+   "self_type" : "_ZTIFjPK6rsa_stE",
+   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIFvvE",
-   "name" : "void (void)",
-   "referenced_type" : "_ZTIFvvE",
-   "return_type" : "_ZTIv",
-   "self_type" : "_ZTIFvvE",
-   "source_file" : "external/boringssl/src/include/openssl/rand.h"
-  }
- ],
- "functions" :
- [
-  {
-   "function_name" : "ACCESS_DESCRIPTION_free",
-   "linker_set_key" : "ACCESS_DESCRIPTION_free",
+   "linker_set_key" : "_ZTIFjPK9ec_key_stE",
+   "name" : "unsigned int (const ec_key_st *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIP21ACCESS_DESCRIPTION_st"
+     "referenced_type" : "_ZTIPK9ec_key_st"
     }
    ],
-   "return_type" : "_ZTIv",
-   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
-  },
-  {
-   "function_name" : "ACCESS_DESCRIPTION_new",
-   "linker_set_key" : "ACCESS_DESCRIPTION_new",
-   "return_type" : "_ZTIP21ACCESS_DESCRIPTION_st",
-   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
+   "referenced_type" : "_ZTIFjPK9ec_key_stE",
+   "return_type" : "_ZTIj",
+   "self_type" : "_ZTIFjPK9ec_key_stE",
+   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
   },
   {
-   "function_name" : "ASN1_BIT_STRING_check",
-   "linker_set_key" : "ASN1_BIT_STRING_check",
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
+   "name" : "long (bio_st *, int, long (*)(bio_st *, int, const char *, int, long, long))",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPK14asn1_string_st"
+     "referenced_type" : "_ZTIP6bio_st"
     },
     {
-     "referenced_type" : "_ZTIPKh"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTIPFlP6bio_stiPKcillE"
     }
    ],
-   "return_type" : "_ZTIi",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+   "referenced_type" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
+   "return_type" : "_ZTIl",
+   "self_type" : "_ZTIFlP6bio_stiPFlS0_iPKcillEE",
+   "source_file" : "external/boringssl/src/include/openssl/bio.h"
   },
   {
-   "function_name" : "ASN1_BIT_STRING_free",
-   "linker_set_key" : "ASN1_BIT_STRING_free",
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFlP6bio_stiPKcillE",
+   "name" : "long (bio_st *, int, const char *, int, long, long)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIP14asn1_string_st"
+     "referenced_type" : "_ZTIP6bio_st"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIPKc"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIl"
+    },
+    {
+     "referenced_type" : "_ZTIl"
     }
    ],
-   "return_type" : "_ZTIv",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+   "referenced_type" : "_ZTIFlP6bio_stiPKcillE",
+   "return_type" : "_ZTIl",
+   "self_type" : "_ZTIFlP6bio_stiPKcillE",
+   "source_file" : "external/boringssl/src/include/openssl/bio.h"
   },
   {
-   "function_name" : "ASN1_BIT_STRING_get_bit",
-   "linker_set_key" : "ASN1_BIT_STRING_get_bit",
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFlP6bio_stilPvE",
+   "name" : "long (bio_st *, int, long, void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPK14asn1_string_st"
+     "referenced_type" : "_ZTIP6bio_st"
     },
     {
      "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIl"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
     }
    ],
-   "return_type" : "_ZTIi",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+   "referenced_type" : "_ZTIFlP6bio_stilPvE",
+   "return_type" : "_ZTIl",
+   "self_type" : "_ZTIFlP6bio_stilPvE",
+   "source_file" : "external/boringssl/src/include/openssl/bio.h"
   },
   {
-   "function_name" : "ASN1_BIT_STRING_new",
-   "linker_set_key" : "ASN1_BIT_STRING_new",
-   "return_type" : "_ZTIP14asn1_string_st",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFmvE",
+   "name" : "unsigned long (void)",
+   "referenced_type" : "_ZTIFmvE",
+   "return_type" : "_ZTIm",
+   "self_type" : "_ZTIFmvE",
+   "source_file" : "external/boringssl/src/include/openssl/thread.h"
   },
   {
-   "function_name" : "ASN1_BIT_STRING_num_bytes",
-   "linker_set_key" : "ASN1_BIT_STRING_num_bytes",
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFvP20CRYPTO_dynlock_valuePKciE",
+   "name" : "void (CRYPTO_dynlock_value *, const char *, int)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPK14asn1_string_st"
+     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
     },
     {
-     "referenced_type" : "_ZTIPj"
+     "referenced_type" : "_ZTIPKc"
+    },
+    {
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "return_type" : "_ZTIi",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+   "referenced_type" : "_ZTIFvP20CRYPTO_dynlock_valuePKciE",
+   "return_type" : "_ZTIv",
+   "self_type" : "_ZTIFvP20CRYPTO_dynlock_valuePKciE",
+   "source_file" : "external/boringssl/src/include/openssl/thread.h"
   },
   {
-   "function_name" : "ASN1_BIT_STRING_set",
-   "linker_set_key" : "ASN1_BIT_STRING_set",
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFvPFvPvES_E",
+   "name" : "void (void (*)(void *), void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIP14asn1_string_st"
+     "referenced_type" : "_ZTIPFvPvE"
     },
     {
-     "referenced_type" : "_ZTIPKh"
+     "referenced_type" : "_ZTIPv"
+    }
+   ],
+   "referenced_type" : "_ZTIFvPFvPvES_E",
+   "return_type" : "_ZTIv",
+   "self_type" : "_ZTIFvPFvPvES_E",
+   "source_file" : "external/boringssl/src/include/openssl/stack.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFvPKviE",
+   "name" : "void (const void *, int)",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIPKv"
     },
     {
      "referenced_type" : "_ZTIi"
     }
    ],
-   "return_type" : "_ZTIi",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+   "referenced_type" : "_ZTIFvPKviE",
+   "return_type" : "_ZTIv",
+   "self_type" : "_ZTIFvPKviE",
+   "source_file" : "external/boringssl/src/include/openssl/rand.h"
   },
   {
-   "function_name" : "ASN1_BIT_STRING_set_bit",
-   "linker_set_key" : "ASN1_BIT_STRING_set_bit",
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFvPKvidE",
+   "name" : "void (const void *, int, double)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIP14asn1_string_st"
+     "referenced_type" : "_ZTIPKv"
     },
     {
      "referenced_type" : "_ZTIi"
     },
     {
-     "referenced_type" : "_ZTIi"
+     "referenced_type" : "_ZTId"
     }
    ],
-   "return_type" : "_ZTIi",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+   "referenced_type" : "_ZTIFvPKvidE",
+   "return_type" : "_ZTIv",
+   "self_type" : "_ZTIFvPKvidE",
+   "source_file" : "external/boringssl/src/include/openssl/rand.h"
   },
   {
-   "function_name" : "ASN1_BMPSTRING_free",
-   "linker_set_key" : "ASN1_BMPSTRING_free",
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFvPiE",
+   "name" : "void (int *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIP14asn1_string_st"
+     "referenced_type" : "_ZTIPi"
     }
    ],
+   "referenced_type" : "_ZTIFvPiE",
    "return_type" : "_ZTIv",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
-  },
-  {
-   "function_name" : "ASN1_BMPSTRING_new",
-   "linker_set_key" : "ASN1_BMPSTRING_new",
-   "return_type" : "_ZTIP14asn1_string_st",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+   "self_type" : "_ZTIFvPiE",
+   "source_file" : "external/boringssl/src/include/openssl/thread.h"
   },
   {
-   "function_name" : "ASN1_ENUMERATED_free",
-   "linker_set_key" : "ASN1_ENUMERATED_free",
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFvPvE",
+   "name" : "void (void *)",
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIP14asn1_string_st"
+     "referenced_type" : "_ZTIPv"
     }
    ],
+   "referenced_type" : "_ZTIFvPvE",
    "return_type" : "_ZTIv",
-   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
-  },
+   "self_type" : "_ZTIFvPvE",
+   "source_file" : "external/boringssl/src/include/openssl/stack.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFvPvS_P17crypto_ex_data_stilS_E",
+   "name" : "void (void *, void *, crypto_ex_data_st *, int, long, void *)",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "referenced_type" : "_ZTIP17crypto_ex_data_st"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIl"
+    },
+    {
+     "referenced_type" : "_ZTIPv"
+    }
+   ],
+   "referenced_type" : "_ZTIFvPvS_P17crypto_ex_data_stilS_E",
+   "return_type" : "_ZTIv",
+   "self_type" : "_ZTIFvPvS_P17crypto_ex_data_stilS_E",
+   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFviP20CRYPTO_dynlock_valuePKciE",
+   "name" : "void (int, CRYPTO_dynlock_value *, const char *, int)",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
+    },
+    {
+     "referenced_type" : "_ZTIPKc"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "referenced_type" : "_ZTIFviP20CRYPTO_dynlock_valuePKciE",
+   "return_type" : "_ZTIv",
+   "self_type" : "_ZTIFviP20CRYPTO_dynlock_valuePKciE",
+   "source_file" : "external/boringssl/src/include/openssl/thread.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFviiPKciE",
+   "name" : "void (int, int, const char *, int)",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIPKc"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "referenced_type" : "_ZTIFviiPKciE",
+   "return_type" : "_ZTIv",
+   "self_type" : "_ZTIFviiPKciE",
+   "source_file" : "external/boringssl/src/include/openssl/thread.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIFvvE",
+   "name" : "void (void)",
+   "referenced_type" : "_ZTIFvvE",
+   "return_type" : "_ZTIv",
+   "self_type" : "_ZTIFvvE",
+   "source_file" : "external/boringssl/src/include/openssl/rand.h"
+  }
+ ],
+ "functions" :
+ [
+  {
+   "function_name" : "ACCESS_DESCRIPTION_free",
+   "linker_set_key" : "ACCESS_DESCRIPTION_free",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIP21ACCESS_DESCRIPTION_st"
+    }
+   ],
+   "return_type" : "_ZTIv",
+   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
+  },
+  {
+   "function_name" : "ACCESS_DESCRIPTION_new",
+   "linker_set_key" : "ACCESS_DESCRIPTION_new",
+   "return_type" : "_ZTIP21ACCESS_DESCRIPTION_st",
+   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
+  },
+  {
+   "function_name" : "ASN1_BIT_STRING_check",
+   "linker_set_key" : "ASN1_BIT_STRING_check",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIPK14asn1_string_st"
+    },
+    {
+     "referenced_type" : "_ZTIPKh"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "return_type" : "_ZTIi",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
+  {
+   "function_name" : "ASN1_BIT_STRING_free",
+   "linker_set_key" : "ASN1_BIT_STRING_free",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIP14asn1_string_st"
+    }
+   ],
+   "return_type" : "_ZTIv",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
+  {
+   "function_name" : "ASN1_BIT_STRING_get_bit",
+   "linker_set_key" : "ASN1_BIT_STRING_get_bit",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIPK14asn1_string_st"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "return_type" : "_ZTIi",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
+  {
+   "function_name" : "ASN1_BIT_STRING_new",
+   "linker_set_key" : "ASN1_BIT_STRING_new",
+   "return_type" : "_ZTIP14asn1_string_st",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
+  {
+   "function_name" : "ASN1_BIT_STRING_num_bytes",
+   "linker_set_key" : "ASN1_BIT_STRING_num_bytes",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIPK14asn1_string_st"
+    },
+    {
+     "referenced_type" : "_ZTIPj"
+    }
+   ],
+   "return_type" : "_ZTIi",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
+  {
+   "function_name" : "ASN1_BIT_STRING_set",
+   "linker_set_key" : "ASN1_BIT_STRING_set",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIP14asn1_string_st"
+    },
+    {
+     "referenced_type" : "_ZTIPKh"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "return_type" : "_ZTIi",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
+  {
+   "function_name" : "ASN1_BIT_STRING_set_bit",
+   "linker_set_key" : "ASN1_BIT_STRING_set_bit",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIP14asn1_string_st"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "return_type" : "_ZTIi",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
+  {
+   "function_name" : "ASN1_BMPSTRING_free",
+   "linker_set_key" : "ASN1_BMPSTRING_free",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIP14asn1_string_st"
+    }
+   ],
+   "return_type" : "_ZTIv",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
+  {
+   "function_name" : "ASN1_BMPSTRING_new",
+   "linker_set_key" : "ASN1_BMPSTRING_new",
+   "return_type" : "_ZTIP14asn1_string_st",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
+  {
+   "function_name" : "ASN1_ENUMERATED_free",
+   "linker_set_key" : "ASN1_ENUMERATED_free",
+   "parameters" :
+   [
+    {
+     "referenced_type" : "_ZTIP14asn1_string_st"
+    }
+   ],
+   "return_type" : "_ZTIv",
+   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
+  },
   {
    "function_name" : "ASN1_ENUMERATED_get",
    "linker_set_key" : "ASN1_ENUMERATED_get",
@@ -10927,7 +11215,7 @@
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
     },
     {
      "referenced_type" : "_ZTIP13X509_algor_st"
@@ -10957,7 +11245,7 @@
    "parameters" :
    [
     {
-     "referenced_type" : "_ZTIPK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump"
+     "referenced_type" : "_ZTIPK12ASN1_ITEM_st"
     },
     {
      "referenced_type" : "_ZTIP13X509_algor_st"
@@ -38090,6 +38378,15 @@
    "size" : 4,
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
@@ -38101,10 +38398,109 @@
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIPFiiiP11bn_gencb_stE",
-   "name" : "int (*)(int, int, bn_gencb_st *)",
-   "referenced_type" : "_ZTIFiiiP11bn_gencb_stE",
-   "self_type" : "_ZTIPFiiiP11bn_gencb_stE",
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE",
+   "name" : "int (*)(int, ASN1_VALUE_st **, const ASN1_ITEM_st *, void *)",
+   "referenced_type" : "_ZTIFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
+   "self_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
+   "size" : 4,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPFiiiP11bn_gencb_stE",
+   "name" : "int (*)(int, int, bn_gencb_st *)",
+   "referenced_type" : "_ZTIFiiiP11bn_gencb_stE",
+   "self_type" : "_ZTIPFiiiP11bn_gencb_stE",
    "size" : 4,
    "source_file" : "external/boringssl/src/include/openssl/bn.h"
   },
@@ -38364,17 +38760,8 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIPK12ASN1_ITEM_st",
    "name" : "const ASN1_ITEM_st *",
-   "referenced_type" : "_ZTIK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
-   "self_type" : "_ZTIPK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
-   "size" : 4,
-   "source_file" : "external/boringssl/src/include/openssl/x509.h"
-  },
-  {
-   "alignment" : 4,
-   "linker_set_key" : "_ZTIPK12ASN1_ITEM_st",
-   "name" : "const ASN1_ITEM_st *",
-   "referenced_type" : "_ZTIK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509v3/v3_pcons.sdump",
-   "self_type" : "_ZTIPK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509v3/v3_pcons.sdump",
+   "referenced_type" : "_ZTIK12ASN1_ITEM_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
+   "self_type" : "_ZTIPK12ASN1_ITEM_st",
    "size" : 4,
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
@@ -40813,180 +41200,612 @@
    "fields" :
    [
     {
-     "field_name" : "r",
-     "referenced_type" : "_ZTIP9bignum_st"
+     "field_name" : "r",
+     "referenced_type" : "_ZTIP9bignum_st"
+    },
+    {
+     "field_name" : "s",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIP9bignum_st"
+    }
+   ],
+   "linker_set_key" : "_ZTI10DSA_SIG_st",
+   "name" : "DSA_SIG_st",
+   "referenced_type" : "_ZTI10DSA_SIG_st",
+   "self_type" : "_ZTI10DSA_SIG_st",
+   "size" : 8,
+   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "rd_key",
+     "referenced_type" : "_ZTIA60_j"
+    },
+    {
+     "field_name" : "rounds",
+     "field_offset" : 1920,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI10aes_key_st",
+   "name" : "aes_key_st",
+   "referenced_type" : "_ZTI10aes_key_st",
+   "self_type" : "_ZTI10aes_key_st",
+   "size" : 244,
+   "source_file" : "external/boringssl/src/include/openssl/aes.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "length",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "data",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIPc"
+    },
+    {
+     "field_name" : "max",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI10buf_mem_st",
+   "name" : "buf_mem_st",
+   "referenced_type" : "_ZTI10buf_mem_st",
+   "self_type" : "_ZTI10buf_mem_st",
+   "size" : 12,
+   "source_file" : "external/boringssl/src/include/openssl/buf.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "x",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "y",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "data",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIA256_j"
+    }
+   ],
+   "linker_set_key" : "_ZTI10rc4_key_st",
+   "name" : "rc4_key_st",
+   "referenced_type" : "_ZTI10rc4_key_st",
+   "self_type" : "_ZTI10rc4_key_st",
+   "size" : 1032,
+   "source_file" : "external/boringssl/src/include/openssl/rc4.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "issuer_cert",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIPK7x509_st"
+    },
+    {
+     "field_name" : "subject_cert",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPK7x509_st"
+    },
+    {
+     "field_name" : "subject_req",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPK11X509_req_st"
+    },
+    {
+     "field_name" : "crl",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK11X509_crl_st"
+    },
+    {
+     "field_name" : "db",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIPK7conf_st"
+    }
+   ],
+   "linker_set_key" : "_ZTI10v3_ext_ctx",
+   "name" : "v3_ext_ctx",
+   "referenced_type" : "_ZTI10v3_ext_ctx",
+   "self_type" : "_ZTI10v3_ext_ctx",
+   "size" : 24,
+   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "offset",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "unused",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIP20asn1_must_be_null_st"
+    },
+    {
+     "field_name" : "tbl",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPK17ASN1_ADB_TABLE_st"
+    },
+    {
+     "field_name" : "tblcount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIl"
+    },
+    {
+     "field_name" : "default_tt",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIPK16ASN1_TEMPLATE_st"
+    },
+    {
+     "field_name" : "null_tt",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK16ASN1_TEMPLATE_st"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_ADB_st",
+   "name" : "ASN1_ADB_st",
+   "referenced_type" : "_ZTI11ASN1_ADB_st",
+   "self_type" : "_ZTI11ASN1_ADB_st",
+   "size" : 28,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st",
+   "self_type" : "_ZTI11ASN1_AUX_st",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/pkcs8/pkcs8_x509.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_verify.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "s",
+     "field_name" : "flags",
      "field_offset" : 32,
-     "referenced_type" : "_ZTIP9bignum_st"
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10DSA_SIG_st",
-   "name" : "DSA_SIG_st",
-   "referenced_type" : "_ZTI10DSA_SIG_st",
-   "self_type" : "_ZTI10DSA_SIG_st",
-   "size" : 8,
-   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/algorithm.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
    "fields" :
    [
     {
-     "field_name" : "rd_key",
-     "referenced_type" : "_ZTIA60_j"
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "rounds",
-     "field_offset" : 1920,
+     "field_name" : "flags",
+     "field_offset" : 32,
      "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ref_offset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10aes_key_st",
-   "name" : "aes_key_st",
-   "referenced_type" : "_ZTI10aes_key_st",
-   "self_type" : "_ZTI10aes_key_st",
-   "size" : 244,
-   "source_file" : "external/boringssl/src/include/openssl/aes.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/asn1_gen.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
    "fields" :
    [
     {
-     "field_name" : "length",
-     "referenced_type" : "_ZTIj"
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "data",
+     "field_name" : "flags",
      "field_offset" : 32,
-     "referenced_type" : "_ZTIPc"
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "max",
+     "field_name" : "ref_offset",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIj"
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10buf_mem_st",
-   "name" : "buf_mem_st",
-   "referenced_type" : "_ZTI10buf_mem_st",
-   "self_type" : "_ZTI10buf_mem_st",
-   "size" : 12,
-   "source_file" : "external/boringssl/src/include/openssl/buf.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_dir.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
    "fields" :
    [
     {
-     "field_name" : "x",
-     "referenced_type" : "_ZTIj"
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "y",
+     "field_name" : "flags",
      "field_offset" : 32,
      "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "data",
+     "field_name" : "ref_offset",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIA256_j"
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10rc4_key_st",
-   "name" : "rc4_key_st",
-   "referenced_type" : "_ZTI10rc4_key_st",
-   "self_type" : "_ZTI10rc4_key_st",
-   "size" : 1032,
-   "source_file" : "external/boringssl/src/include/openssl/rc4.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/by_file.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
    "fields" :
    [
     {
-     "field_name" : "flags",
-     "referenced_type" : "_ZTIi"
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "issuer_cert",
+     "field_name" : "flags",
      "field_offset" : 32,
-     "referenced_type" : "_ZTIPK7x509_st"
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "subject_cert",
+     "field_name" : "ref_offset",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPK7x509_st"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "field_name" : "subject_req",
+     "field_name" : "asn1_cb",
      "field_offset" : 96,
-     "referenced_type" : "_ZTIPK11X509_req_st"
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump"
     },
     {
-     "field_name" : "crl",
+     "field_name" : "enc_offset",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIPK11X509_crl_st"
-    },
-    {
-     "field_name" : "db",
-     "field_offset" : 160,
-     "referenced_type" : "_ZTIPK7conf_st"
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI10v3_ext_ctx",
-   "name" : "v3_ext_ctx",
-   "referenced_type" : "_ZTI10v3_ext_ctx",
-   "self_type" : "_ZTI10v3_ext_ctx",
-   "size" : 24,
-   "source_file" : "external/boringssl/src/include/openssl/x509v3.h"
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/policy.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
    "alignment" : 4,
    "fields" :
    [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
     {
      "field_name" : "flags",
+     "field_offset" : 32,
      "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "offset",
+     "field_name" : "ref_offset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/rsa_pss.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
      "field_offset" : 32,
-     "referenced_type" : "_ZTIm"
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "unused",
+     "field_name" : "ref_offset",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIP20asn1_must_be_null_st"
+     "referenced_type" : "_ZTIi"
     },
     {
-     "field_name" : "tbl",
+     "field_name" : "asn1_cb",
      "field_offset" : 96,
-     "referenced_type" : "_ZTIPK17ASN1_ADB_TABLE_st"
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump"
     },
     {
-     "field_name" : "tblcount",
+     "field_name" : "enc_offset",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIl"
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_req.sdump",
+   "size" : 20,
+   "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "app_data",
+     "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "default_tt",
-     "field_offset" : 160,
-     "referenced_type" : "_ZTIPK16ASN1_TEMPLATE_st"
+     "field_name" : "flags",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "null_tt",
-     "field_offset" : 192,
-     "referenced_type" : "_ZTIPK16ASN1_TEMPLATE_st"
+     "field_name" : "ref_offset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "asn1_cb",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump"
+    },
+    {
+     "field_name" : "enc_offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
     }
    ],
-   "linker_set_key" : "_ZTI11ASN1_ADB_st",
-   "name" : "ASN1_ADB_st",
-   "referenced_type" : "_ZTI11ASN1_ADB_st",
-   "self_type" : "_ZTI11ASN1_ADB_st",
-   "size" : 28,
+   "linker_set_key" : "_ZTI11ASN1_AUX_st",
+   "name" : "ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509.sdump",
+   "size" : 20,
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
   {
@@ -41010,7 +41829,7 @@
     {
      "field_name" : "asn1_cb",
      "field_offset" : 96,
-     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE"
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump"
     },
     {
      "field_name" : "enc_offset",
@@ -41020,8 +41839,8 @@
    ],
    "linker_set_key" : "_ZTI11ASN1_AUX_st",
    "name" : "ASN1_AUX_st",
-   "referenced_type" : "_ZTI11ASN1_AUX_st",
-   "self_type" : "_ZTI11ASN1_AUX_st",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/t_x509a.sdump",
    "size" : 20,
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
@@ -41046,7 +41865,7 @@
     {
      "field_name" : "asn1_cb",
      "field_offset" : 96,
-     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump"
+     "referenced_type" : "_ZTIPFiiPP13ASN1_VALUE_stPK12ASN1_ITEM_stPvE#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump"
     },
     {
      "field_name" : "enc_offset",
@@ -41056,8 +41875,8 @@
    ],
    "linker_set_key" : "_ZTI11ASN1_AUX_st",
    "name" : "ASN1_AUX_st",
-   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
-   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/a_sign.sdump",
+   "referenced_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
+   "self_type" : "_ZTI11ASN1_AUX_st#ODR:out/soong/.intermediates/external/boringssl/libcrypto/android_vendor.34_arm_armv8-a_shared/obj/external/boringssl/src/crypto/x509/x509_att.sdump",
    "size" : 20,
    "source_file" : "external/boringssl/src/include/openssl/asn1t.h"
   },
-- 
2.34.1

